### Midterm_RitaWu
### This file is the main process of processing datasets:
### Goals: create an new_inventory table and fact_order table for the sakila dataset.
## 0. IMPORTANT!!!! please run saklia files and mysamplesql before running this file!!!!
#### 1. get existing data from the dataset and export them to a new a sakila_dw1 SCHEMAS
    # 1.1 select from local server
    # 1.2 select from local json file
    # 1.3 select from MongoDB cloud json file
####  2. merge the table into an easy access and quick search table with the desired information
####  3. insert new_inventory table and fact_order table back into the local sakila_dw1 database
#### 4. check and select the information you want

#### Import the Necessary Libraries

In [1]:
import os
import json
import numpy
import datetime
import urllib
import pandas as pd

import pymongo
from sqlalchemy import create_engine

#### Declare & Assign Connection Variables for the MongoDB Server, the MySQL Server & Databases

In [17]:
#connect with mongoDB and Atlas cloud
mysql_uid = "root"
mysql_pwd = "Wsr2022winwin@"

atlas_cluster_name = "Cluster0"
atlas_user_name = "user"
atlas_password = "Passw0rd123"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : "mongodb+srv://user:Passw0rd123@Cluster0.v52vbkh.mongodb.net"
}


src_dbname = "sakila_dw1"
dst_dbname = "sakila_dw1"


#connect with local sql server      
host_name = "localhost"
host_ip = "127.0.0.1"
port = "3306"
user_id = "root"
pwd = "Wsr2022winwin@"
db_name = src_dbname;


print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://user:Passw0rd123@Cluster0.v52vbkh.mongodb.net

#### Define Functions for Getting Data From and Setting Data Into Databases

In [3]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### 1.0. Select needed data from different sources

In [4]:
#linked with my local sql server
conn_str = f"mysql+pymysql://{mysql_uid}:{mysql_pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

#sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
#sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

#### select rental data from the dim_rental table already set up in local sql server

In [5]:
sql_rental = "SELECT * FROM sakila_dw1.dim_rental;"
df_rental = get_sql_dataframe(user_id, pwd, src_dbname, sql_rental)
df_rental.rename(columns={"rental_key":"rental_id"}, inplace=True)
df_rental.rename(columns={"last_update":"last_update_rent"}, inplace=True)
df_rental.rename(columns={"return_date":"return_date_rent"}, inplace=True)
#df_rental.drop('last_update', axis=1, inplace=True)
df_rental['rental_date'] = df_rental['rental_date'].astype(str)
df_rental[['order_date', 'rental_time']] = df_rental['rental_date'].str.split(' ', 1, expand=True)
#df_rental['date_name']=(pd.to_datetime(df_rental['date_name'].str.strip()))
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date_rent,staff_id,last_update_rent,order_date,rental_time
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005-05-24,22:53:30
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005-05-24,22:54:33

#### select store data from the local dim_store JSON file

In [6]:
#READ FROM JSON FILE
df_store = pd.read_json("dim_store.json",lines = True);
df_store.rename(columns={"last_update":"last_update_store"}, inplace=True)
df_store.drop('address_id', axis=1, inplace=True)
df_store.head(2)

   store_key  manager_staff_id    last_update_store
0          1                 1  2006-02-15 04:57:12
1          2                 2  2006-02-15 04:57:12

####  select staff data from the local dim_staff JSON file

In [7]:
#READ FROM JSON FILE
df_staff = pd.read_json("dim_staff.json",lines = True);
df_staff.drop('address_id', axis=1, inplace=True)
df_staff.rename(columns={"last_update":"last_update_staff"}, inplace=True)
df_staff.rename(columns={"first_name":"first_name_staff"}, inplace=True)
df_staff.rename(columns={"last_name":"last_name_staff"}, inplace=True)
df_staff.head(2)

,staff_key,first_name_staff,last_name_staff,picture,email,store_id,active,username,password,last_update_staff
0,1,Mike,Hillyer,null,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

####  select film data from the local sakila sql film table

In [8]:
sql_film = "SELECT * FROM sakila.film;"
df_film = get_sql_dataframe(user_id, pwd, src_dbname, sql_film)
df_film.drop('last_update', axis=1, inplace=True)
df_film.drop('language_id', axis=1, inplace=True)
df_film.drop('original_language_id', axis=1, inplace=True)
df_film.drop('length', axis=1, inplace=True)
df_film.drop('special_features', axis=1, inplace=True)
df_film.drop('description', axis=1, inplace=True)

df_film.head(2)

,film_id,title,release_year,rental_duration,rental_rate,replacement_cost,rating
0,1,ACADEMY DINOSAUR,2006,6,0.99,20.99,PG
1,2,ACE GOLDFINGER,2006,3,4.99,12.99,G

####  select inventory data from the local sakila sql film table

In [9]:
sql_inventory = "SELECT * FROM sakila.inventory;"
df_inventory = get_sql_dataframe(user_id, pwd, src_dbname, sql_inventory)

df_inventory.drop('last_update', axis=1, inplace=True)

df_inventory.head(2)

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1

####  select date data from the dim_date table in local sql

In [10]:
sql_date = "SELECT date_key, full_date FROM sakila_dw1.dim_date;"
df_dim_date = get_sql_dataframe(user_id, pwd, src_dbname, sql_date)
df_dim_date['date_name'] = df_dim_date['full_date'].astype(str)


df_dim_date.full_date = df_dim_date.full_date.astype('datetime64')
df_dim_date.head(2)

   date_key  full_date   date_name
0  20050101 2005-01-01  2005-01-01
1  20050102 2005-01-02  2005-01-02

####  merge date data from the dim_date table with the time in rental data

In [11]:
# Lookup the Surrogate Primary Key (date_key) that Corresponds to the "order_date" Column.
df_dim_order_date = df_dim_date.rename(columns={"date_key" : "order_date_key", "full_date" : "order_date"})
df_dim_order_date['order_date'] = pd.to_datetime(df_dim_order_date['order_date'], utc = True)
df_rental['order_date'] = pd.to_datetime(df_rental['order_date'], utc = True)
df_rental = pd.merge(df_rental, df_dim_order_date, on='order_date', how='inner')
df_rental.drop(['order_date'], axis=1, inplace=True)
df_rental.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date_rent,staff_id,last_update_rent,rental_time,order_date_key,date_name
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,22:53:30,20050524,2005-05-24
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,22:54:33,20050524,2005-05-24

### connect to MongoDB cloud

In [12]:
#dim customer from MongoDB

#print(os.getcwd())
client = pymongo.MongoClient("mongodb+srv://user:Passw0rd123@Cluster0.v52vbkh.mongodb.net")
db = client[src_dbname]
data_dir = os.path.join(os.getcwd(), 'data')
print(data_dir)

json_files = {"customers" :'sakila_customer.json'}

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        print(f"{file} was successfully loaded.")

        
client.close()

C:\Users\Rita Wu\data
Collection(Database(MongoClient(host=['ac-9lajmoe-shard-00-02.v52vbkh.mongodb.net:27017', 'ac-9lajmoe-shard-00-00.v52vbkh.mongodb.net:27017', 'ac-9lajmoe-shard-00-01.v52vbkh.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, authsource='admin', replicaset='atlas-13eona-shard-0', tls=True), 'sakila_dw1'), 'customers') was successfully loaded.

#### use MongoDB to select customer data (json file) from cloud space

In [18]:
query = {}
collection = "customers"
df_customer = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_customer.rename(columns={"customer_key":"customer_id"}, inplace=True)
df_customer.rename(columns={"create_date":"create_date_customer"}, inplace=True)
df_customer.rename(columns={"last_update":"last_update_customer"}, inplace=True)
df_customer.rename(columns={"first_name":"first_name_customer"}, inplace=True)
df_customer.rename(columns={"last_name":"last_name_customer"}, inplace=True)
df_customer.head(2)

,customer_id,store_id,first_name_customer,last_name_customer,email,address_id,active,create_date_customer,last_update_customer
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

### merge inventory data with film data

In [19]:
df_new_inventory = pd.merge(df_inventory, df_film, on='film_id', how='right')
df_new_inventory.rename(columns={"customer_key":"customer_id"}, inplace=True)
df_new_inventory.drop('store_id', axis=1, inplace=True)
df_new_inventory['inventory_key'] = range(0, len(df_new_inventory))
display(df_new_inventory.head(2))

,inventory_id,film_id,title,release_year,rental_duration,rental_rate,replacement_cost,rating,inventory_key
0,1.0,1,ACADEMY DINOSAUR,2006,6,0.99,20.99,PG,0
1,2.0,1,ACADEMY DINOSAUR,2006,6,0.99,20.99,PG,1

### merge rental data with the new_inventory table, customer data, and staff data to create a fact table

In [20]:
#load df_rental with df_enriched_inventory, df_payment, df_customer to make fact_rental
df_rental_new= pd.merge(df_rental, df_new_inventory, on='inventory_id', how='right')

df_rental_new= pd.merge(df_rental_new, df_customer, on='customer_id', how='left' )

df_rental_new= pd.merge(df_rental_new, df_staff, on='store_id', how='left' )

df_rental_new.sort_values(by=['rental_id'], inplace=True)
display(df_rental_new.head(2))

,rental_id,rental_date,inventory_id,customer_id,return_date_rent,staff_id,last_update_rent,rental_time,order_date_key,date_name,...,last_update_customer,staff_key,first_name_staff,last_name_staff,picture,email_y,active_y,username,password,last_update_staff
1283,1.0,2005-05-24 22:53:30,367.0,130.0,2005-05-26 22:04:30,1.0,2006-02-15 21:30:53,22:53:30,20050524.0,2005-05-24,...,2006-02-15 04:57:20,1.0,Mike,Hillyer,null,Mike.Hillyer@sakilastaff.com,1.0,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
5360,2.0,2005-05-24 22:54:33,1525.0,459.0,2005-05-28 19:40:33,1.0,2006-02-15 21:30:53,22:54:33,20050524.0,2005-05-24,...,2006-02-15 04:57:20,1.0,Mike,Hillyer,null,Mike.Hillyer@sakilastaff.com,1.0,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16

### add fact_key to fact table and select need data

In [21]:
df_fact_table = df_rental_new
df_fact_table['fact_key'] = range(0, len(df_fact_table))
df_fact_table = df_fact_table[['fact_key', 'rental_id', 'inventory_id', 'film_id', 'staff_id', 'store_id', 
                                 'customer_id', 'rental_duration', 
                                 'first_name_staff', 'last_name_staff', 'first_name_customer', 'last_name_customer', 'title', 'rating','release_year','order_date_key']]
display(df_fact_table.head(2))

,fact_key,rental_id,inventory_id,film_id,staff_id,store_id,customer_id,rental_duration,first_name_staff,last_name_staff,first_name_customer,last_name_customer,title,rating,release_year,order_date_key
1283,0,1.0,367.0,80,1.0,1.0,130.0,7,Mike,Hillyer,CHARLOTTE,HUNTER,BLANKET BEVERLY,G,2006,20050524.0
5360,1,2.0,1525.0,333,1.0,1.0,459.0,7,Mike,Hillyer,TOMMY,COLLAZO,FREAKY POCUS,R,2006,20050524.0

### insert the created table back to the local sql

In [22]:
db_operation = "insert"
set_dataframe(user_id, pwd, dst_dbname, df_film, 'dim_film', 'film_id', db_operation)
set_dataframe(user_id, pwd, dst_dbname, df_inventory, 'dim_inventory', 'inventory_id', db_operation)
set_dataframe(user_id, pwd, dst_dbname, df_fact_table, 'fact_table', 'fact_key', db_operation)
set_dataframe(user_id, pwd, dst_dbname, df_new_inventory, 'new_inventory', 'inventory_key', db_operation)

### check everything works well -- with 2 select statement

In [23]:
sql_fact_orders = "SELECT * FROM sakila_dw1.fact_table";
df_fact_order_check = get_sql_dataframe(user_id, pwd, src_dbname,sql_fact_orders)
df_fact_order_check.head(2)

,fact_key,rental_id,inventory_id,film_id,staff_id,store_id,customer_id,rental_duration,first_name_staff,last_name_staff,first_name_customer,last_name_customer,title,rating,release_year,order_date_key
0,0,1.0,367.0,80,1.0,1.0,130.0,7,Mike,Hillyer,CHARLOTTE,HUNTER,BLANKET BEVERLY,G,2006,20050524.0
1,1,2.0,1525.0,333,1.0,1.0,459.0,7,Mike,Hillyer,TOMMY,COLLAZO,FREAKY POCUS,R,2006,20050524.0

In [24]:
sql_new_inventory = "SELECT * FROM sakila_dw1.new_inventory";
df_new_inventory_check = get_sql_dataframe(user_id, pwd, src_dbname,sql_new_inventory)
df_new_inventory_check.head(2)

,inventory_id,film_id,title,release_year,rental_duration,rental_rate,replacement_cost,rating,inventory_key
0,1.0,1,ACADEMY DINOSAUR,2006,6,0.99,20.99,PG,0
1,2.0,1,ACADEMY DINOSAUR,2006,6,0.99,20.99,PG,1

### 3 additional select statement

In [25]:
# average rental duration
sql_test1 = """ 
   SELECT AVG(`rental_duration`),last_name_staff FROM `fact_table` GROUP BY last_name_staff;""".format(dst_dbname)
df_test1 = get_sql_dataframe(user_id, pwd, src_dbname, sql_test1)
df_test1.head(2)

   AVG(`rental_duration`) last_name_staff
0                  4.9423         Hillyer
1                  4.9274        Stephens

In [26]:
# average replacement cost
sql_test2 = """ 
  SELECT AVG(`replacement_cost`), `rating` FROM `new_inventory` GROUP BY rating;""".format(dst_dbname)
df_test2 = get_sql_dataframe(user_id, pwd, src_dbname, sql_test2)
df_test2

   AVG(`replacement_cost`) rating
0                19.202834     PG
1                20.427343      G
2                20.257857  NC-17
3                20.668016  PG-13
4                20.439451      R

In [27]:
#number of rows in the merged dataset
sql_test3 = """ 
   SELECT MAX(`fact_key`) FROM `sakila_dw1`.`fact_table`;""".format(dst_dbname)
df_test3 = get_sql_dataframe(user_id, pwd, src_dbname, sql_test3)
df_test3.head()

   MAX(`fact_key`)
0            16086